In [1]:
import csv
import json
import mysql.connector

# please modify hw4_config.json to your own config file
with open('hw5_config.json') as f:
    config = json.load(f)

host = config['host']
user = config['user']
passwd = config['passwd']
dbms_student_path = config['dbms_student_path']
new_student_path = config['new_student_path']

## 1-1: Input data into student table

In [2]:
import pandas as pd
import sqlalchemy as sql

studentData = pd.read_csv(dbms_student_path, index_col=False, encoding='Big5')
studentData.fillna("", inplace=True)
studentData['系所'] = studentData['系所'].str.strip()
studentData['姓名'] = studentData['姓名'].str.replace('"', '')

studentData[:5]

,身份,系所,年級,學號,姓名,信箱,班別
0,學生,經濟系,3,B10303008,劉家妮 (CHIA-NIH LIU),b10303008@ntu.edu.tw,資料庫系統-從SQL到NoSQL (EE5178)
1,學生,經濟系,3,B10303129,"吳東諺 (WU, TUNG-YEN)",b10303129@ntu.edu.tw,資料庫系統-從SQL到NoSQL (EE5178)
2,學生,經濟系,4,B09303019,"黃于軒 (HUANG,YU-hsUAN)",b09303019@ntu.edu.tw,資料庫系統-從SQL到NoSQL (EE5178)
3,學生,經濟系,4,B09303021,"李胤愷 (Lee, yin-kai)",b09303021@ntu.edu.tw,資料庫系統-從SQL到NoSQL (EE5178)
4,學生,經濟系,4,B09303027,"林睿霖 (LIN,RUEI-LIN)",b09303027@ntu.edu.tw,資料庫系統-從SQL到NoSQL (EE5178)

In [3]:
# Connect to MySQL
conn = mysql.connector.connect(
    host=host,
    user=user,
    password=passwd
)

if conn.is_connected():
    cursor = conn.cursor()
    cursor.execute("DROP DATABASE IF EXISTS hw5DB;")
    cursor.execute("CREATE DATABASE hw5DB;")
    cursor.execute("USE hw5DB;")
    conn.commit()

In [4]:
db = "hw5DB"
sql_engine = sql.create_engine(f"mysql+mysqlconnector://{user}:{passwd}@localhost/{db}")

In [5]:
studentData.to_sql('student', con = sql_engine, if_exists = 'append', chunksize = 1000, index=False)

103

## 1-2: Read the information about yourself

In [6]:
cursor.execute("SELECT * FROM student WHERE 學號 = 'R12921105'")
result = cursor.fetchall()
print(result)

[('學生', '電機所', 1, 'R12921105', '游景恩 (YU, JING-EN)', 'r12921105@ntu.edu.tw', '資料庫系統-從SQL到NoSQL (EE5178)')]

## 1-3: Update your own value of the "身份" column

In [7]:
cursor.execute("UPDATE student SET 身份 = '特優生' WHERE 學號 = 'r12921105'")
conn.commit()

cursor.execute("SELECT * FROM student WHERE 學號 = 'r12921105'")
updated_result = cursor.fetchall()
print(updated_result)

[('特優生', '電機所', 1, 'R12921105', '游景恩 (YU, JING-EN)', 'r12921105@ntu.edu.tw', '資料庫系統-從SQL到NoSQL (EE5178)')]

## 1-4: Insert three new students

In [8]:
new_student_data = pd.read_csv(new_student_path, index_col=False)
new_student_data.to_sql('student', con=sql_engine, if_exists='append', index=False)
conn.commit()

## 1-5: Prepared select statement

In [9]:
query = "SELECT * FROM student WHERE 學號 = %s"
student_ids = ['R10123456', 'B09987653', 'R11123001']

for student_id in student_ids:
    cursor.execute(query, (student_id,))
    student_info = cursor.fetchone()
    if student_info:
        print(student_info)
    else:
        print("No student found with ID", student_id)

('旁聽生', '電機所', 2, 'R10123456', '小紅', 'r10123456@ntu.edu.tw', '資料庫系統-從SQL到NoSQL (EE5178)')
('學生', '物理系', 3, 'B09987653', '小黃', 'b09987653@ntu.edu.tw', '資料庫系統-從SQL到NoSQL (EE5178)')
('觀察者', '電信所', 1, 'R11123001', '小綠', 'r11123001@ntu.edu.tw', '資料庫系統-從SQL到NoSQL (EE5178)')

## 1-6: Group information

In [10]:
# (1) Use “alter table” to add two new columns “group” and “captain” into your table 
alter_query = """
    ALTER TABLE student
    ADD COLUMN `group` INT,
    ADD COLUMN captain VARCHAR(1)
    """
cursor.execute(alter_query)
conn.commit()
# (2) input your group number into this column for each your group members; for all other students, input 0 as their group number for this homework. 
update_group_query = """
    UPDATE student
    SET `group` = CASE 
                    WHEN 學號 IN ('R12944014', 'R12921039', 'R12921105', 'R12922045') THEN 4
                    ELSE 0
                 END
    """
cursor.execute(update_group_query)
conn.commit()
# (3) Input “1” (or “Y”) into the “captain” column for the captain of your group. For all other people, the value of this column can be “0” (or “N”) for this homework 
update_captain_query = """
    UPDATE student
    SET captain = CASE WHEN 學號 = 'R12922045' THEN 'Y' ELSE 'N' END
    """
cursor.execute(update_captain_query)
conn.commit()
# (4) Select and list the information of your group members, along with the value of “group” and “captain” columns. 
# (select the members using the group number, rather than student ID or name to complete.) 
cursor.execute("SELECT 學號, 姓名, 信箱, `group`, captain FROM student WHERE `group` = 4")
updated_result = cursor.fetchall()
print(updated_result)